### GitHub  
ソフトウェア開発プロジェクトのためのソースコード管理サービス
コードの閲覧や簡単なバグ管理機能、SNSの機能を持っている
#### 基本知識
1. ローカルリポジトリとリモートリポジトリ(保存場所)
2. コミット(commit)とプッシュ(push)
commit ファイルの追加や変更の履歴をレポジトリに保存すること
push ファイルの追加や変更の履歴をリモートレポジトリにアップロードするための操作
3. ブランチ(branch)
ソフトウェアの開発では、現在リリースしてるバージョンのメンテナンスをしながら新たな機能追加やバグ修正を行うことがあり、並行して行われる複数のバージョン管理を行うために、Gitにはbranch機能がある
branchは履歴の流れを分岐して記録していくもの

#### GitHubの流れ
1. (初回)レポジトリを作成(git init), または複製(git clone)をする
2. ファイルの作成、編集を行う
3. ファイルの作成/変更/削除をgitのインデックスに追加(git add)
4. 変更結果をローカルリポジトリにコミットする(git commit)
5. ローカルリポジトリをプッシュしてリモートリポジトリへ反映させる(git push)

#### ブランチ(branch)の使い方
ブランチ一覧(git branch)
ブランチの作成(git branch sub1)
ブランチの移動(git checkout sub1)
作成と移動をまとめて行うgit checkout -b sub1

###### ブランチにプッシュ
git add morning.html
git commit -m "add file goodmorning"
→ローカルリポジトリに対してファイルの追加が記録される
git push origin sub1
→リモートリポジトリに反映 ここではブランチ名を指定するだけでプッシュ可能

###### ブランチからプル
git checkout sub1
リポジトリsub1にチェックアウト
git pull
リモートブランチsub1のコードを取得

###### ブランチのマージ
ブランチに取り込む作業のこと
開発現場では新機能をブランチを作って開発を行い、テストが完了したら、メインのmasterブランチに取り込む、という流れで開発作業を行う
